#ifndef FUNCS_H
#define FUNCS_H

#include <stdio.h>
#include <stdlib.h>

/**
 * @brief Виділяє динамічну пам'ять для двовимірної матриці.
 *
 * @details Виділяє пам'ять для масиву вказівників, що представляють рядки, 
 * а потім послідовно виділяє пам'ять для стовпців кожного рядка.
 *
 * @param rows Кількість рядків у матриці.
 * @param cols Кількість стовпців у матриці.
 *
 * @return Вказівник на виділену двовимірну матрицю (int**), або NULL у разі помилки виділення пам'яті.
 */
int** memory_allocation(int rows, int cols);

/**
 * @brief Звільняє динамічно виділену пам'ять двовимірної матриці.
 *
 * @details Ітерується по кожному рядку для звільнення індивідуальної пам'яті рядків 
 * і зрештою звільняє основний масив вказівників на рядки.
 *
 * @param matrix Вказівник на двовимірну матрицю, яку потрібно очистити.
 * @param rows   Кількість рядків у матриці.
 */
void clearMemory(int** matrix, int rows);

/**
 * @brief Знаходить максимальний та мінімальний елементи під головною діагоналю двовимірної матриці.
 *
 * @details Проходить по всіх елементах під головною діагоналю для визначення
 * найбільшого й найменшого значень за допомогою вказівників.
 *
 * @param A     Вказівник на двовимірну матрицю.
 * @param r_a   Кількість рядків у матриці A.
 * @param max_a Вказівник для збереження знайденого максимального значення.
 * @param min_a Вказівник для збереження знайденого мінімального значення.
 */
void max_min(int** A, int r_a, int* max_a, int* min_a);

/**
 * @brief Транспонує задану двовимірну матрицю.
 *
 * @details Міняє місцями рядки та стовпці вихідної матриці, створюючи та 
 * повертаючи новостворену транспоновану матрицю.
 *
 * @param B   Вказівник на вихідну двовимірну матрицю.
 * @param r_b Кількість рядків у матриці B.
 * @param c_b Кількість стовпців у матриці B.
 *
 * @return Вказівник на новостворену транспоновану матрицю або NULL у разі помилки.
 */
int** transpose(int** B, int r_b, int c_b);

/**
 * @brief Множить дві матриці (B * A).
 *
 * @details Виконує множення матриці B на матрицю A 
 * відповідно до правил лінійної алгебри, виділяючи пам'ять для результуючої матриці добутку.
 *
 * @param B   Вказівник на першу двовимірну матрицю.
 * @param r_b Кількість рядків у матриці B.
 * @param c_b Кількість стовпців у матриці B.
 * @param A   Вказівник на другу двовимірну матрицю.
 * @param r_a Кількість рядків у матриці A.
 * @param c_a Кількість стовпців у матриці A.
 *
 * @return Вказівник на новостворену результуючу матрицю або NULL у разі помилки.
 */
int** mult_a_b(int** B, int r_b, int c_b, int** A, int r_a, int c_a);

#endif // FUNCS_H